{
  "id": "climate-colab",
  "title": "Climate Colab",
  "image": "projects/climate-colab/image.jpg",
  "description": "A fullstack app written in Typescript using Next.js, socket.io, and Material UI which simulates the decision making that countries make and how those decisions affect our enviromental future. It uses data from the IPCC Report 6 as the backbone for the visualizations.",
  "author": "Yannick Gloster",
  "authorUrl": "https://yannickgloster.com",
  "year": 2023,
  "url": "https://climatecolab.scss.tcd.ie/",
  "thesisUrl": "https://raw.githubusercontent.com/yannickgloster/climate-collab-tool/main/Dissertation.pdf",
  "repoUrl": "https://github.com/yannickgloster/climate-collab-tool",
  "abstract": "Climate change is arguably the biggest challenge facing humanity to date. Its effects are already being felt globally as we see the devastating impacts of increasingly frequent and intense natural disasters, extreme temperatures, food and water shortages, and the displacement of millions of people. Addressing an issue of this size requires a coordinated effort from countries and regions across the globe.\n\nOrganizations worldwide have produced a large amount of data modeling and predictions. Still, there does not often exist a way for non-specialists to interact with this data in a guided manner. As education plays a crucial role in informing people about the causes and consequences of climate change and encouraging individuals to take action to mitigate its effects, it is essential that climate data is made available to people in a useful and engaging way.\n\nThe aim of this dissertation is to design, build, and evaluate the effectiveness of a tool to teach about existing climate scenarios. In particular, the project aims to allow learners to interact with the Intergovernmental Panel on Climate Change (IPCC) Sixth Assessment Report predictions in a way that makes the implications of the choices made at a global level explicit. Using the tool, learners address climate change by making a series of policy decisions for their assigned world region. Using the cumulative decisions made by all of the users, an algorithm generates one of the scenarios presented by the IPCC, allowing the user to get a glimpse into a potential future using real-world climate predictions.\n\nA particular goal is to surface the importance of collaboration to tackle climate change while leveraging and visualizing data from the IPCC and the Coupled Model Intercomparison Project (CMIP). The tool is designed for use by Transition Year students (ages 15-16) in secondary school.\n\nThe tool was built as a multiplayer web application using Typescript, Next.js (a full stack React-based framework), and Socket.IO (a performant WebSocket-based communication protocol). A subset (1.09 GB) of the data (10s of gigabytes) provided alongside the IPCC Sixth Assessment Report was preprocessed in Python and stored on a PostgreSQL server for access by the tool. The interactive visualizations of this data were built using Recharts, react-simple-maps, and D3.js.\n\nThe tool was first tested and evaluated by educators (N=7) and then by students (N=26) in a workshop-based setting. Over the course of 2 days, students participated in multiple different workshops focusing on different elements of climate change, finishing with a 3-hour learning workshop based in the tool presented in this dissertation. A survey was conducted to investigate the usability and effectiveness of the learning experience. While the collected data is not statistically significant, the feedback indicates that the tool successfully engaged these students with the issues and should be rolled out to a larger audience."
}
