{
  "id": "costal-microworld",
  "title": "A Microworld to Teach About Costal Erosion",
  "image": "projects/costal-microworld/image.png",
  "description": "A Microworld to highlight key factors and choices involved in the mitigation of coastal erosion. The tool was created with the goal in mind of providing a learning experience for Transition Year students, with the coastal erosion modelling itself providing a low-fidelity simulation of coastal erosion on a fictional town based in the Dublin area.",
  "author": "Dominique Meudec",
  "year": 2023,
  "url": "https://dme789.github.io/",
  "thesisUrl": "projects/costal-microworld/Coastal-MW.pdf",
  "repoUrl": "https://github.com/dme789/coastal-erosion-microworld",
  "abstract": "Coastal erosion is a serious environmental issue that poses risks to human populations, natural habitats, and the economy. Coastal erosion is caused by the combination of waves,tides, and winds, with the perfect storm capable of severely eroding the land along coastlines. The impact of climate change and the associated rise in sea level over the past few years, which shows no sign of slowing down, has only exacerbated the intensity of storms, which cause coastal erosion and threaten all aspects of coastal ecosystems and habitats.\n\nIn Ireland, sea level rise is occurring at around double the rate of the rest of the globe and storm severity and frequency has increased over the past decade. Focusing on Dublin Bay, which has the most significant coastal population in Ireland, has seen a yearly sea rise rate of 6-7mm over the past 20 years. The likely projections based on data from the IPCC say that by 2100 sea level rise in Dublin could increase by 1.1m, with a 1.98m sea rise in the worst case.\n\nWith most of the current population only likely to see the beginning of the worst effects of coastal erosion in Ireland, it is imperative that the younger populations are educated on coastal erosion. It is vital that they have the correct understanding and knowledge to allow them to make informed decisions as future leaders, not just to prevent coastal erosion but to live with it.\n\nThe number of technologies utilised to educate this demographic on the topic has been limited, focusing mainly on eye-catching videos and visualisations. With minimal technologies having been used to allow users to interact with simulations of coastal erosion, this study will consider all possible technologies available and discuss how learnings from these led to the creation of the tool described in this document. A number of pedagogical ideas, particularly constructivism and constructionism, have had an impact on the design of the microworld simulation. Principles from Human-ComputerInteraction were incorporated to create a tool which would be usable and accessible for the target audience as well as to create visualisations which would encourage cognitive engagement.\n\nThe project involved the design, implementation, and evaluation of the efficacy of a Microworld to highlight key factors and choices involved in the mitigation of coastal erosion. The tool was created with the goal in mind of providing a learning experience for Transition Year students, with the coastal erosion modelling itself providing a low-fidelity simulation of coastal erosion on a fictional town based in the Dublin area. The Microworld allows learners to make decisions about prevention options and to view the impact of their choices each year up until 2100. The learner also has control over climate variables and an annual budget. This allows learners to challenge themselves with more complex scenarios and to visualise the outcomes of mitigation choices they make.\n\nThe main technical difficulties encountered during the tool development are explained, along with how they were resolved and how this influenced the microworld’s design. The design was influenced by considering the complexity of modelling some of the coastal erosion factors and how these could be visualised simply and informally.\n\nThis tool was evaluated with a cohort of Transition Year students in the Bridge2College programme in a fluid classroom-based setting. Students worked in pairs to solve various challenges set. The students were provided with some brief introduction learning material and then interacted with the tool themselves before providing feedback. A post-activity survey assessed whether the Microworld succeeded in improving the users’understanding of coastal erosion and the tool’s usability and suitability for teaching about coastal erosion."
}
