{
  "id": "covid-simulator",
  "title": "Understanding Covid-19",
  "image": "projects/covid-simulator/image.png",
  "description": "This is an interactive tool that enables users to run a variety of simulations which attempt to emulate how a disease such as Covid 19 can spread throughout a population. The user will be able to alter an array of variables in real time and witness the effects these changes have on how the disease spreads through the population, allowing them to develop their own concepts on how important certain factors can be during a pandemic.",
  "author": "Luke Feely",
  "authorUrl": "https://github.com/LukeFeely",
  "year": 2021,
  "url": "https://covid-simulator-tcd.herokuapp.com/",
  "thesisUrl": "/projects/covid-simulator/CovidSimulator.pdf",
  "repoUrl": "https://github.com/LukeFeely/Final-Year-Project-Covid-Simulator-",
  "abstract": "In the midst of an ongoing epidemic, it is now more important than ever for people to obtain an understanding of how viral diseases spread and the factors that can affect this spread. This is particularly prevalent for young people, a demographic whose behaviour can massively affect the rate at which a disease can escalate.\n\nA variety of approaches have been used to attempt to educate this demographic on the complexity and significance of the factors at play. Varying from TV advertisements, to explanatory videos and articles, this study will analyse the efficacy of some of these techniques,in particular how innovative contemporary technology can aid in the teaching of this topic. The design of the educational software used in this project is influenced by a variety of pedagogical theories, centring around how the theories of constructivism and constructionism can be embodied within a micro-world simulation.\n\nThis project explores the design, implementation and evaluation of the effectiveness of a simulation tool which can used to delineate the key concepts and factors involved in suppressing and managing viral diseases. The simulator is designed for use by Transition Year students in secondary school.\n\nThe simulations within the tool are predicated upon classic compartmental epidemiology models, which classify individuals within a population into distinct discrete states. The model used to underpin this tool is the S.E.I.R (Susceptible, Exposed, Infected, Removed) model, a sit is the most applicable to a disease such as Covid-19. The tool is designed as a low fidelity simulation, placing its focus on illuminating the key considerations involved in the decision-making process around Covid-19, rather than attempting to scientifically model or predict real-life outcomes. The simulator allows the learner to alter certain variables and witness the effects this has upon how a disease spreads, by clearly visualising the effects the choices they make within the program have upon the outcome. The tool is challenge based, setting out three key challenges to engage the learner and illustrate the important dynamics and trade-offs involved.\n\nThe fundamental technical challenges faced in the development of the tool are discussed, along with how these challenges were overcome and how this shaped the design of the simulator. The influence for the design explores a myriad of data visualisation and interactivity techniques, which were analysed and considered when designing the simulator.\n\nNaturally, due to Covid-19 it was not possible to evaluate and test this tool in the classroom setting for which it was designed. However, a cohort (N=43) of Transition Year students were able to interact with and give feedback on the tool through a series of online classes run by Trinity Access – TCD’s major outreach programme. An online survey was conducted to gauge the usability and effectiveness of the tool from a pedagogical standpoint. Analysis of the quantitative and qualitative feedback on the tool suggested that the tool was successful in its primary goal of building a simulator which encompassed pedagogical and constructionist characteristics to enhance the learner’s understanding of viral diseases."
}
