{
  "id": "election-microworld",
  "title": "Understanding Electoral Systems",
  "image": "projects/election-microworld/image.png",
  "description": "A simulator to aid in the teaching of electoral vote counting and constituency configuration",
  "author": "Lee Campbell",
  "authorUrl": "https://leecampbell.ie/",
  "year": 2020,
  "url": "https://electoral-simulator.firebaseapp.com/",
  "thesisUrl": "projects/election-microworld/ElectionMicroWorld.pdf",
  "abstract": "In an era when democracy is under threat from a variety of sources, some of them technical in origin, successful civic education is increasingly difficult, and more important than ever.\n\nResearch shows that an understanding of how electoral systems work is a critical factor in voter turnout and promotes equal civic participation across all demographics by equipping young people to navigate new media sources. Despite this, educators often lack the tools to effectively help students to fully understand how electoral systems work, how they can be manipulated, and how that manipulation can affect political outcomes. The aim of this project is to design, build and evaluate the effectiveness of a simulator to aid the teaching of constituency configuration and vote counting. The simulator is designed for use by Transition Year students in secondary school.\n\nDifferent pedagogical theories are used to underpin the design of the instructional software. In this study, the ideas of constructivism and constructionism are embodied in a micro-world simulation. The simulator allows the learner to configure an election by changing constituency boundaries and electoral voting systems and clearly visualises the effects that these decisions have on the outcome of an election. This study draws on a range of data visualisation and human-computer interaction techniques to develop novel ways of allowing users to do this, for example, the use of Voronoi diagrams to improve the fluidity of constituency manipulation compared to previous systems. The application itself models two electoral systems PR-STV and First Past the Post, and seeks to create realistic scenarios;building phenomena such as transfer-pacts between parties into the dataset. A variety of visualisation libraries are also considered and analysed with D3.js eventually selected.\n\nWhile it was not possible to evaluate the tool with Transition Year students due to COVID-19, an online general survey was distributed to staff and students of the author’s university in order to gather views on the tool’s effectiveness, while an educator specific survey was also disseminated to gauge its effectiveness from a pedagogical perspective. Analysis of the general survey showed the potential of the tool to affect changes in user opinions of fair and unfair types of elections. Educators felt that the tool had the potential to increase engagement and improve learning outcomes for students, with 98% of respondents (N=22) stating they would be likely to use or recommend using the tool. Respondents in both surveys also expressed satisfaction with the overall usability of the tool, which was measured by a post-study system usability questionnaire. The results indicate that the simulator encompasses many of the constructionist and pedagogical attributes desired to promote positive learning outcomes and impact individuals’ understanding of electoral systems. However, further work is needed to evaluate the tool with real learners in a suitable learning environment as originally intended and to further develop the tool to include real election data and additional systems."
}
