{
  "id": "geopolitical",
  "title": "Serious games for teaching issues to do with sustainability and climate change",
  "image": "projects/geopolitical/image.png",
  "description": "A 'serious game' designed to promote engagement with climate change education in the classroom of adolescents and to impart users with the seed to stay booking at climate change from a geopolitical perspective.",
  "author": "Nixon Okoli",
  "year": 2023,
  "url": "https://carbon-quest.vercel.app/",
  "thesisUrl": "/projects/geopolitical/GeoPolitical.pdf",
  "repoUrl": "https://github.com/Nickson-0/Carbon-Quest-Frontend",
  "abstract": "This thesis aims to delineate the development and evaluation of the “serious game” CarbonQuest, designed to promote engagement with climate change education in the classroom of adolescents and to impart users with the seed to stay booking at climate change from a geopolitical perspective. Grounded in current pedagogical literature and human-computer interaction principles, the game seeks to foster empathy for the inequality of climate change impact for countries in the poor global south and provoke relevant discourse about carbon footprints at the geopolitical level. To evaluate the effectiveness of the game a cohort of 5 Transition Year students from Irish secondary schools were engaged in a comprehensive testing process. This process involved playing games through to the end, participating in group discussions about completing questionnaires to assess engagement and learning outcomes.\n\nThe results show that the majority of participants found the game helpful in understanding the concepts of sustainability and climate change as well as in developing their appreciation for the geopolitical factors that affect climate change. However some participants felt the game’s representation of sustainability and climate change issues could be more impartial and equitable.\n\nIn conclusion, CarbonQuest has demonstrated its potential to facilitate learning and engagement in climate change education specifically, the intricate interplay between geopolitical factors and environmental repercussions. Due to its small sample size more testing is required to conclusively establish its efficacy as a learning tool."
}
