{
  "id": "national-carbon-microworld",
  "title": "A Microworld to Explore Controlling the National Carbon Footprint",
  "image": "projects/national-carbon-microworld/image.png",
  "description": "The software is designed to serve as a low-fidelity simulation, with the goal of highlighting the essential issues involved in the government’s decision-making processes surrounding mitigation techniques to lower the Carbon Footprint of Ireland.",
  "author": "Sarah Dolan",
  "year": 2023,
  "url": "https://challenge1.on.fleek.co/",
  "thesisUrl": "/projects/national-carbon-microworld/NationalCarbonFP-MW.pdf",
  "repoUrl": "https://github.com/sarahdolan1/Challenge1-Carbonfootprint",
  "abstract": "Climate Change is one of the greatest challenges facing the world at present. It is caused by there lease of greenhouse gases, such as carbon dioxide and methane, into the atmosphere, which traps heat causing the Earth’s temperature to rise. This leads to a variety of negative effects,including the rise of sea levels, severe weather events and changes in the patterns and amount of precipitation. These changes can have devastating consequences for human societies and natural ecosystems, including flooding, drought, and the extinction of plant and animal species.\n\nThe Carbon Footprint is a measure of the amount of greenhouse gases produced. The unit used is carbon dioxide equivalents. Currently, Ireland has a Carbon Footprint of 61 million tonnes. This is approximately 50% higher than the EU (European Union) average per capita. As per the Paris Agreement, Ireland has agreed to the 2030 goal of a 51% reduction in the National Carbon Footprint.\n\nOur carbon footprint is of relevance to young people as they are the future leaders and decision-makers who will inherit the consequences of our actions today. Through education, we can empower them to make informed decisions and take action to mitigate the impacts of ClimateChange. An array of techniques are used to educate this demographic on the complexities and importance of the factors at play. These vary from visualisations and calculators to simulators and games. More important than the technology used, is the underlying approach to teaching and learning which varies from direct instruction to problem-solving.\n\nThe tool described in this report is aimed for use in a university outreach program –Bridge2College (B2C) – aimed at 15-17-year-old secondary school students. The B2C workshops follow constructivist and constructionist pedagogical approaches (Kevin Sullivan,2021). Microworlds align well with such pedagogical approaches so the report details the design, implementation, and evaluation of the efficiency of a Microworld tool that can be used to investigate the key concepts and factors involved in controlling Ireland’s carbon footprint.\n\nThe software is designed to serve as a low-fidelity simulation, with the goal of highlighting the essential issues involved in the government’s decision-making processes surrounding mitigation techniques to lower the Carbon Footprint of Ireland. The tool allows users to make decisions and witness the effects of these decisions, over time, on Ireland’s Carbon Footprint.The Microworld is challenge-based setting out two key challenges to stimulate the learner and illustrate the essential dynamics and trade-offs involved in reducing Ireland’s CarbonFootprint.\n\nThe principal technical challenges encountered during the tool's development are discussed, as well as how these challenges were overcome and how this influenced the Microworld design.\n\nThe efficiency of the tool was tested following the B2C workshop by a cohort of (N=23)students. A survey was performed to assess the tool's usability and effectiveness from a pedagogical perspective. The aim of the survey was to see how effectively the students responded to active participation in their learning. The quantitative and qualitative feedback indicated that it was successful in its main aim of developing a Microworld with pedagogical and constructionist characteristics to enhance the learner's understanding of how to control the national carbon footprint. Although designed with B2C in mind, the tool should be useable in any Transition Year setting which uses a similar pedagogical approach."
}
