{
  "id": "soil",
  "title": "Understanding Soil and Water Sustainability",
  "image": "projects/soil/image.png",
  "description": "A project which aims to teach undergraduate Botany students about the impact of farming on soil and water quality through a Microworld.",
  "author": "Emer Murphy",
  "year": 2023,
  "thesisUrl": "/projects/soil/Soil.pdf",
  "repoUrl": "https://github.com/emer289/FinalYearProject2023",
  "abstract": "With the challenges presented by loss of biodiversity, the need to understand sustainability has become more important than ever. Making sustainable choices is crucial to protect the planet, such as maintaining healthy soil and waterways. The health of these resources is important for sustaining life and ensuring global food and nutritional security, as well as for supporting biodiversity. Therefore, it is important to educate people about these issues, to ensure they are equipped with the knowledge to make informed decisions and take actions that promote environmental sustainability.\n\nMicroworlds are a type of educational computer simulation in which the learner can engage with a simplified model of a real-world phenomenon in order to come to a deeper understanding of the phenomena in question. The aim of this project is to design, develop and evaluate a Microworld to teach undergraduate Botany students about the impact of farming on soil and water quality. The learner can gain knowledge on both growing crops and preserving the environment by learning how to minimise the impact of farming on soil and water resources. This is done by allowing the learner to select crops, the amount of fertiliser and whether or not to include a vegetative buffer strip, and then simulating what happens over time. This application's design allows the learner to quickly understand the mechanics of the simulation and to easily interact with the microworld. The microworld was implemented as a web application utilising HTML, CSS, JavaScript and P5.js. These technologies provide minimal pre-built functionality, enabling the developer to design and implement visualisations that align with the specific needs and requirements of the application.\n\nTo provide triangulation, the microworld was tested by multiple audiences. The audiences evaluated the tool’s usability and educational value. The testing group was comprised of an academic from the School of Botany (the project domain expert), Ph.D. Botany students, and non-Botany undergraduates. Both quantitative and qualitative data was collected. (Plans to test the tool with Botany undergraduates did not come to fruition for reasons outside the author’s control). From a Human Computer Interaction perspective, data from the System UsabilityScale indicated that respondents were satisfied with the overall usability of the tool, with all respondents (N=11) stating they would recommend using the tool in an educational setting.Analysis of other data showed the tool helped learners to understand the topic and raised awareness of environmental issues among the respondents."
}
