{
  "id": "transport-microworld",
  "title": "A Microworld to teach the impact of transport on Ireland’s carbon emissions",
  "image": "projects/transport-microworld/image.png",
  "description": "The microworld aims to teach the impact of transport on Ireland’s carbon emissions.",
  "author": "Michael Sweeney",
  "authorUrl": "http://example.com",
  "year": 2023,
  "thesisUrl": "/projects/transport-microworld/Transport-MW.pdf",
  "repoUrl": "https://github.com/mikeysweeney/fyp",
  "abstract": "Climate change is one of the most prominent challenges facing humanity today, with potentially devastating consequences for human societies and natural ecosystems. The primary cause of climate change is the release of greenhouse gases (GHGs) such as carbon dioxide (CO2) and methane into the atmosphere. To mitigate the impacts of climate change, it is crucial to address the factors contributing to GHG emissions, one of which is transport. Addressing this challenge requires educating future leaders and decision-makers on the impacts of their choices. This report details the design, implementation, and evaluation of a microworld tool aimed at teaching the impact of transport on Ireland's carbon emissions and is targeted at Transition Year students as it fits best with the student curriculum at that level.\n\nIreland is a country that has experienced rapid economic growth over the past few decades, leading to a substantial increase in transport demand resulting in the sector becoming a significant contributor to the country's carbon emissions. This report aims to provide an in-depth understanding of factors that drive Ireland's carbon emissions, focusing primarily on the transport sector, and explore the potential of a microworld tool to educate young people on their contribution to those emissions.\n\nLimited technology has been utilized to educate students on issues related to sustainability and climate change, particularly in relation to transport. Therefore, we will explore various available technologies and analyse their potential impact on the development of a Microworld that educates users on sustainable transportation choices and greenhouse gas emissions. The microworld tool is consistent with constructivist and constructionist educational philosophies, functioning as a simplified simulation that illustrates the complexities and compromises associated with addressing transportation's impact on Ireland's carbon emissions. The tool presents two key challenges to engage learners and illustrate the essential dynamics at play.\n\nThe design of the microworld includes multiple components that aim to engage students in understanding the relationship between transportation choices and GHG emissions. These components consist of an interactive data presentation, a calendar-based challenge to estimate individual carbon emissions and a final challenge for the individual student to meet the 2030/2050emission reduction goals. The implementation process involves the selection of appropriate technologies, such as web-based programming languages and data visualization libraries, to create an engaging and user-friendly microworld with real impact.\n\nThe development process encountered several technical challenges, which are discussed alongside the solutions implemented and their influence on the microworld design. The tool was evaluated and tested in a workshop setting by a cohort of 26 students participating in the Bridge2College program, a university outreach activity.\n\nStudents interacted with the tool and provided feedback, while a survey assessed its usability and pedagogical effectiveness. Both quantitative and qualitative feedback indicated the success of the microworld in achieving its main aim: to develop a tool with pedagogical and constructionist characteristics that improve learners' understanding of how to control transport's impact onIreland's carbon emissions. The microworld's effectiveness is assessed through improving students’understanding and knowledge of these issues. The insights and experiences gained from the development and evaluation of this microworld contribute to the potential of educational microworlds to address complex environmental and societal issues as well as the need for greater integration of such educational approaches into mainstream education to address the pressing challenges of climate change and sustainability."
}
